
#Область ПрограммныйИнтерфейс

// Программно выводит реквизиты на форму
Процедура ДополнитьФорму(Форма) Экспорт
// Форма это ЭтотОбъект
// 
// НачалоДоработки
// Николаев В.Е. Задача 002 от 13.10.2024

ИмяФормы = Форма.ИмяФормы;

Если ИмяФормы = "Документ.ЗаказПокупателя.Форма.ФормаДокумента" Тогда
	ДобавитьПолеКонтактноеЛицоВГруппаШапкаПраво(Форма);
	
	// НачалоДоработки
	// Николаев В.Е. Задача 003 от 13.10.2024

	ДобавитьПолеСогласованнаяСкидкаВГруппаШапкаЛево(Форма);
	ДобавитьКомандуПересчитать(Форма);
	
	// КонецДоработки	
		
ИначеЕсли ИмяФормы = "Документ.ОплатаОтПокупателя.Форма.ФормаДокумента" Тогда
	ВставитьПолеКонтактноеЛицоНаФормуПередОснование(Форма);
ИначеЕсли ИмяФормы = "Документ.ОплатаПоставщику.Форма.ФормаДокумента" Тогда
	ВставитьПолеКонтактноеЛицоНаФормуПередСуммаДокумента(Форма);
ИначеЕсли ИмяФормы = "Документ.ПоступлениеТоваровУслуг.Форма.ФормаДокумента" Тогда
	ДобавитьПолеКонтактноеЛицоВГруппаШапкаПраво(Форма);
ИначеЕсли ИмяФормы = "Документ.РеализацияТоваровУслуг.Форма.ФормаДокумента" Тогда
	ДобавитьПолеКонтактноеЛицоВГруппаШапкаПраво(Форма);
КонецЕсли;

// КонецДоработки
	
КонецПроцедуры

#КонецОбласти


#Область СлужебныеПроцедурыИФункции

Процедура ДобавитьПолеКонтактноеЛицоВГруппаШапкаПраво(Форма)

// НачалоДоработки
// Николаев В.Е. Задача 002 от 13.10.2024

ПолеВвода = Форма.Элементы.Добавить("КонтактноеЛицо", Тип("ПолеФормы"), Форма.Элементы.ГруппаШапкаПраво);
ПолеВвода.Вид = ВидПоляФормы.ПолеВвода;
ПолеВвода.ПутьКДанным = "Объект.Дораб_КонтактноеЛицо";

// КонецДоработки

КонецПроцедуры

Процедура ВставитьПолеКонтактноеЛицоНаФормуПередОснование(Форма)

// НачалоДоработки
// Николаев В.Е. Задача 002 от 13.10.2024

ПолеВвода = Форма.Элементы.Вставить("КонтактноеЛицо", Тип("ПолеФормы"), , Форма.Элементы.Основание);
ПолеВвода.Вид = ВидПоляФормы.ПолеВвода;
ПолеВвода.ПутьКДанным = "Объект.Дораб_КонтактноеЛицо";

// КонецДоработки	
	
КонецПроцедуры

Процедура ВставитьПолеКонтактноеЛицоНаФормуПередСуммаДокумента(Форма)

// НачалоДоработки
// Николаев В.Е. Задача 002 от 13.10.2024

ПолеВвода = Форма.Элементы.Вставить("КонтактноеЛицо", Тип("ПолеФормы"), , Форма.Элементы.СуммаДокумента);
ПолеВвода.Вид = ВидПоляФормы.ПолеВвода;
ПолеВвода.ПутьКДанным = "Объект.Дораб_КонтактноеЛицо";

// КонецДоработки	
	
КонецПроцедуры

Процедура ДобавитьПолеСогласованнаяСкидкаВГруппаШапкаЛево(Форма)
	
// НачалоДоработки
// Николаев В.Е. Задача 003 от 13.10.2024

ПолеВвода = Форма.Элементы.Добавить("СогласованнаяСкидка", Тип("ПолеФормы"), Форма.Элементы.ГруппаШапкаЛево);
ПолеВвода.Вид = ВидПоляФормы.ПолеВвода;
ПолеВвода.ПутьКДанным = "Объект.Дораб_СогласованнаяСкидка";

// КонецДоработки
	
КонецПроцедуры

Процедура ДобавитьКомандуПересчитать(Форма)

// НачалоДоработки
// Николаев В.Е. Задача 003 от 13.10.2024

Команда = Форма.Команды.Добавить("Пересчитать");
Команда.Заголовок = ("Пересчитать");
Команда.Действие = ("КомандаПересчитать");

КнопкаФормы = Форма.Элементы.Добавить("КнопкаПересчитать", Тип("КнопкаФормы"), Форма.Элементы.ГруппаШапкаЛево);
КнопкаФормы.ИмяКоманды = ("Пересчитать");
КнопкаФормы.Вид = ВидКнопкиФормы.ОбычнаяКнопка;

// КонецДоработки	
	
КонецПроцедуры

#КонецОбласти